{"pageProps":{"article":{"content":"\n# Deployment\n\n## Node.js Server\n\nNext.js can be deployed to any hosting provider that supports Node.js. Make sure your `package.json` \nhas the `\"build\"` and `\"start\"` scripts:\n\n```json\n{\n  \"scripts\": {\n    \"dev\": \"next\",\n    \"build\": \"next build\",\n    \"start\": \"next start\"\n  }\n}\n```\n\n`next build` builds the production application in the `.next` folder. After building, `next start` \nstarts a Node.js server that supports hybrid pages, serving both statically generated and \nserver-side rendered pages.\n\n## Static HTML Export\n\n`next export` allows you to export your app to static HTML, which can be run standalone without the \nneed of a Node.js server.\n\nThe exported app supports almost every feature of Next.js, including dynamic routes, prefetching, \npreloading and dynamic imports.\n\n`next export` works by prerendering all pages to HTML. For dynamic routes, your page can export a \n`getStaticPaths` function to let the exporter know which HTML pages to generate for that route.\n\nBy default, `next export` will generate an `out` directory, which can be served by any static \nhosting service or CDN.\n\nThe choice of your server software isn’t important either. Since the output of the export command \nis completely platform-agnostic, there’s no need to explicitly use Node.\n\n### Vercel Deployment\n\nThe easiest way to deploy Next.js to production is to use the `Vercel` platform from the creators of \nNext.js. `Vercel` is a cloud platform for static sites, hybrid apps, and Serverless Functions. Read \nmore about it from [official docs](https://nextjs.org/docs/deployment)\n\n### Netlify Deployment\n\nNetlify lets you link a GitHub, GitLab, or Bitbucket repository to a site for continuous deployment. \nEach time you push to your Git provider, Netlify runs a build with your tool of choice and deploys \nthe result to their CDN. Read more about it from \n[official docs](https://docs.netlify.com/configure-builds/get-started)\n\n### Firebase Hosting\n\nUsing the Firebase CLI, you deploy files from local directories on your computer to your Hosting\nserver. Beyond serving static content, you can use Cloud Functions for Firebase or Cloud Run to\nserve dynamic content and host microservices on your sites. Read more about it\nfrom [official docs](https://firebase.google.com/docs/hosting).\n","slug":"deployment","title":"Deployment"}},"__N_SSG":true}